Revit 2027 API
PointOnEdge Methods
The PointOnEdge type exposes the following members.
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetEdgeReference | Get a copy of the edge or curve reference.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetEdgeReference | Change the edge or curve reference.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
PointOnEdge Class
Autodesk.Revit.DB Namespace